Tekla.Structures.Plugins.DirectManipulation.Core.ControlBase
The Tekla.Structures.Plugins.DirectManipulation.Core.ControlBase class is an abstract base class for all UI controls provided by the API.

Tekla.Structures.Plugins.DirectManipulation.Core.ControlBase.disposed
Indicates whether all internal resources have been disposed of.

Tekla.Structures.Plugins.DirectManipulation.Core.ControlBase.Enabled
Gets or sets a value indicating whether the control can respond to user interaction.

Tekla.Structures.Plugins.DirectManipulation.Core.ControlBase.Image
Gets or sets the image that is displayed on the item.

Tekla.Structures.Plugins.DirectManipulation.Core.ControlBase.CustomProperties
Gets or sets the custom properties of the control.

Tekla.Structures.Plugins.DirectManipulation.Core.ControlBase.Tag
Gets or sets the object that contains data about the item.

Tekla.Structures.Plugins.DirectManipulation.Core.ControlBase.Text
Gets or sets the text that is to be displayed on the item.

Tekla.Structures.Plugins.DirectManipulation.Core.ControlBase.Tooltip
Gets or sets the tooltip of the control.

Tekla.Structures.Plugins.DirectManipulation.Core.ControlBase.Visible
Gets or sets a value indicating whether the control is displayed.

Tekla.Structures.Plugins.DirectManipulation.Core.ControlBase.InternalControl
Gets the internal control.

Tekla.Structures.Plugins.DirectManipulation.Core.ControlBase.Dispose
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.

Tekla.Structures.Plugins.DirectManipulation.Core.ControlBase.Dispose(System.Boolean)
Releases unmanaged and - optionally - managed resources.
disposing: true to release both managed and unmanaged resources; false to release only unmanaged resources.